package com.company;
//Напишите программу, которая выводит на экран «5,4,3,2,1» используя цикл for.
public class C5 {
    public static void main(String args[]){
        for (int i = 5; i > 0; i--){
            System.out.println(i);
        }
    }
}
